20230618213505-management.org
:PROPERTIES:
:ID:       6d4acc78-c16a-4d50-bcff-f8443e917a35
:END:
#+title: Management
* 概要
開発マネジメントについて。
* Memo
* Tasks
** TODO [[https://zenn.dev/tbpgr/books/a962605736e5da][組織づくりをエンジニアリングするZennBook]]
組織づくりの本。
* Reference
** [[https://mtx2s.hatenablog.com/entry/2022/04/10/110514][マルチバリューストリームというアンチパターン - mtx2s’s blog]]
閉鎖性共通の原則は開発プロセスにもあてはまる。
** [[https://mtx2s.hatenablog.com/entry/2020/01/26/171647][Feature Parity - 機能負債がレガシーシステムのマイグレーションを失敗させる - mtx2s’s blog]]
技術負債はよく知られているが、機能負債もあり、大きく影響している。

#+begin_quote
つまり、ポジティブな価値であったはずの「新機能」が、実際にローンチしてみると、ネガティブな価値である「欠陥」に位置付けられている。これが、機能負債の正体。
#+end_quote
** [[https://mtx2s.hatenablog.com/entry/2023/03/27/222358][リリースした新機能や改善の多くに価値がないという調査結果が意味すること - mtx2s’s blog]]
- 機能の64%は使われない
- コストがかかるだけでなく、むしろ価値を損なわせる
- すべての新機能を特定の指標によって評価する。成功率は50％を下回っているという
** [[https://mtx2s.hatenablog.com/entry/2021/04/28/082951][「体験」にコミットするチームと「仕様」にコミットするチーム - mtx2s’s blog]]
- 仕様は仮説にすぎない。

#+begin_quote
仕様や、それに基づいて作られたプロダクトは、あくまで仮説に過ぎない。顧客に体験してもらい、その仮説を検証してこそ、プロダクトに対して本当に求められている姿が見えてくる。仕様に対するプロダクトの品質より、体験に対するプロダクトの品質を真としてそこに近づけようとする。それが、「体験にコミットする」ということだ。
#+end_quote

- 体験にコミットすると顧客視点で仕様を見るようになる
- 体験にコミットすると顧客の反応を計測するようになる
* Archives
