20230618213505-management.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-30T23:11:48Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Management</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">Management</h1>
<div id="outline-container-orgfddb819" class="outline-2">
<h2 id="orgfddb819"><a href="#orgfddb819">概要</a></h2>
<div class="outline-text-2" id="text-orgfddb819">
<p>
開発マネジメントについて。
</p>
</div>
</div>
<div id="outline-container-orgcf72812" class="outline-2">
<h2 id="orgcf72812"><a href="#orgcf72812">Memo</a></h2>
</div>
<div id="outline-container-orga0d305d" class="outline-2">
<h2 id="orga0d305d"><a href="#orga0d305d">Tasks</a></h2>
<div class="outline-text-2" id="text-orga0d305d">
</div>
<div id="outline-container-orgb7db289" class="outline-3">
<h3 id="orgb7db289"><a href="#orgb7db289"><span class="todo TODO">TODO</span> <a href="https://zenn.dev/tbpgr/books/a962605736e5da">組織づくりをエンジニアリングするZennBook</a></a></h3>
<div class="outline-text-3" id="text-orgb7db289">
<p>
組織づくりの本。
</p>
</div>
</div>
</div>
<div id="outline-container-org65c3a23" class="outline-2">
<h2 id="org65c3a23"><a href="#org65c3a23">Reference</a></h2>
<div class="outline-text-2" id="text-org65c3a23">
</div>
<div id="outline-container-orgb22dc4a" class="outline-3">
<h3 id="orgb22dc4a"><a href="#orgb22dc4a"><a href="https://mtx2s.hatenablog.com/entry/2022/04/10/110514">マルチバリューストリームというアンチパターン - mtx2s’s blog</a></a></h3>
<div class="outline-text-3" id="text-orgb22dc4a">
<p>
閉鎖性共通の原則は開発プロセスにもあてはまる。
</p>
</div>
</div>
<div id="outline-container-org1448940" class="outline-3">
<h3 id="org1448940"><a href="#org1448940"><a href="https://mtx2s.hatenablog.com/entry/2020/01/26/171647">Feature Parity - 機能負債がレガシーシステムのマイグレーションを失敗させる - mtx2s’s blog</a></a></h3>
<div class="outline-text-3" id="text-org1448940">
<p>
技術負債はよく知られているが、機能負債もあり、大きく影響している。
</p>

<blockquote>
<p>
つまり、ポジティブな価値であったはずの「新機能」が、実際にローンチしてみると、ネガティブな価値である「欠陥」に位置付けられている。これが、機能負債の正体。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgdeb3805" class="outline-3">
<h3 id="orgdeb3805"><a href="#orgdeb3805"><a href="https://mtx2s.hatenablog.com/entry/2023/03/27/222358">リリースした新機能や改善の多くに価値がないという調査結果が意味すること - mtx2s’s blog</a></a></h3>
<div class="outline-text-3" id="text-orgdeb3805">
<ul class="org-ul">
<li>機能の64%は使われない</li>
<li>コストがかかるだけでなく、むしろ価値を損なわせる</li>
<li>すべての新機能を特定の指標によって評価する。成功率は50％を下回っているという</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd46251" class="outline-3">
<h3 id="orgdd46251"><a href="#orgdd46251"><a href="https://mtx2s.hatenablog.com/entry/2021/04/28/082951">「体験」にコミットするチームと「仕様」にコミットするチーム - mtx2s’s blog</a></a></h3>
<div class="outline-text-3" id="text-orgdd46251">
<ul class="org-ul">
<li>仕様は仮説にすぎない。</li>
</ul>

<blockquote>
<p>
仕様や、それに基づいて作られたプロダクトは、あくまで仮説に過ぎない。顧客に体験してもらい、その仮説を検証してこそ、プロダクトに対して本当に求められている姿が見えてくる。仕様に対するプロダクトの品質より、体験に対するプロダクトの品質を真としてそこに近づけようとする。それが、「体験にコミットする」ということだ。
</p>
</blockquote>

<ul class="org-ul">
<li>体験にコミットすると顧客視点で仕様を見るようになる</li>
<li>体験にコミットすると顧客の反応を計測するようになる</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb3459c8" class="outline-2">
<h2 id="orgb3459c8"><a href="#orgb3459c8">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
